Repository: 84000/data-translation-memory
Catalog: toh136-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཞལ་འཛུམ་པ་མཛད་དོ། །
en: Then, at that moment, the Blessed One smiled.

source: འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ཉིད་དེ་གང་གི་ཚེ་འཛུམ་པ་མཛད་པ་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་ཁ་དོག་སྣ་ཚོགས་ཁ་དོག་དུ་མ་འདི་ལྟ་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་།
en: And as is the case whenever blessed buddhas smile, streams of multicolored light—blue, yellow, red, white, crimson, crystalline, and silver—came from the Blessed One’s mouth.

source: བཙོད་ཀ་དང་། ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་དག་བྱུང་སྟེ། དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་དག་སྣང་བས་གསལ་བར་བྱས་ནས་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་མངོན་པར་འཕགས་ཏེ་ཡང་ཕྱིར་ལོག་ནས་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ།
en: This light illuminated countless world systems, spreading all the way up to the highest reaches of the Brahmā realms, and then returned, circled the Blessed One three times, and vanished into the crown of his head.

source: བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏུ་ནུབ་པ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་ཚིགས་སུ་བཅད་པས་ཡོངས་སུ་ཞུས་པ། འཇིག་རྟེན་སྣང་མཛད་ཇི་སླད་དུ། །འཛུམ་པ་མཛད་པའི་རྒྱུ་གང་ལ་གས། །
en: Venerable Ānanda saw this, and he entreated the Blessed One in verse: “For what reason do you smile, Thus illuminating the world?

source: བདག་དང་སྲོག་ཆགས་གཞན་དག་གི། །སོམ་ཉི་ལེགས་པར་བསལ་དུ་གསོལ། །
en: Please dispel my doubts And those of other beings!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་གྱད་ཀྱི་བུ་འདི་དག་ལྷགས་ཏེ་སེམས་རབ་ཏུ་དང་བས་ང་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དམིགས་མེད་དང་། མདོ་སྡེའི་ཚིག་བསྟན་པ་འདི་ལ་ཐལ་མོ་སྦྱར་ཅིང་རབ་ཏུ་བཏུད་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་བྱེད་པ་དག་མཐོང་ངམ།
en: The Blessed One replied, “Ānanda, did you see those Malla sons who with sincere reverence bowed with folded hands to me, to the bodhisattva great being Without Reference, and to the teachings of this discourse and generated the mind set on complete, unsurpassed awakening?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ། །
en: “I saw them, Blessed One,” replied Ānanda.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་གྱད་ཀྱི་བུ་འདི་དག་ཐམས་ཅད་ནི་བསྐལ་པ་གྲངས་མེད་པ་བྱེ་བར་ངན་འགྲོ་ལོག་པར་ལྟུང་བར་འགྲོ་བར་མི་འགྱུར་ཞིང་དེ་དག་ཕྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ཡང་འགྱུར་རོ། །
en: The Blessed One continued, “Ānanda, those Malla sons will not fall into the lower realms of rebirth for countless millions of eons, and later they will fully awaken in unsurpassed, completely perfect awakening.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །ཡིད་བདེ་མགུ་བའི་སེམས་ལྡན་པའི། །གྱད་ཀྱི་བུ་རྣམས་འདིར་ལྷགས་ཏེ། །ཐལ་མོ་སྦྱར་ཅིང་རབ་བཏུད་པ། །ཀུན་དགའ་ཁྱོད་ཀྱིས་མ་མཐོང་ངམ། །
en: The Blessed One then spoke these verses: “Those Malla sons have come here With joy and delight And bowed with folded hands— Did you not see, Ānanda?

source: མཁས་པ་འདི་དག་ཐམས་ཅད་ཀྱིས། །ང་ལ་མཆོད་པ་འདི་བྱས་ནས། །བླ་མེད་བྱང་ཆུབ་འཐོབ་འགྱུར་བར། །མགུ་བ་ཉིད་ཀྱིས་རྗོད་པར་བྱེད། །
en: “All these wise ones Have made offerings to me, And they joyfully speak Of attaining supreme awakening.

source: དམིགས་མེད་ཤེས་རབ་ལྡན་པ་དང་། །ཆོས་ལའང་གུས་དང་བཅས་བྱས་ཤིང་། །དེ་བཞིན་ཉན་ཐོས་དགེ་འདུན་ལ། །ཐལ་མོ་སྦྱར་བ་འདི་བྱས་པས། །
en: “With faith in the Dharma, In the insightful Without Reference, And in the community of disciples, They have pressed their palms together.

source: བསྐལ་པ་བྱེ་བ་གྲངས་མེད་དུ། །དེ་དག་ངན་འགྲོར་འགྲོ་མི་འགྱུར། ཐལ་མོ་སྦྱར་བའི་ལས་དང་ནི། །ལུས་རབ་བཏུད་པས་ཕྱིན་ཆད་ནི། །དེ་དག་བྱང་ཆུབ་འཐོབ་འགྱུར་བའི། །
en: “Through this act of joining their hands And bowing their bodies, They will not fall into lower realms For countless millions of eons, “And it is certain that in the future They will reach perfect awakening.

source: ཕུན་སུམ་ཚོགས་པ་ཅིར་འགྱུར་བ། །ང་ཡིས་བསྐལ་པའམ་བསྐལ་པ་ནི། །བྱེ་བ་ཕྲག་བརྒྱར་བརྗོད་གྱུར་ཀྱང་། །སྤྱོད་པ་དམ་པ་སྤྱད་བྱས་པ། །དེ་ལ་གྲངས་ནི་ཡོད་མིན་པས། །
en: Were I to describe their abundance For a billion eons, “The activities of their sublime conduct Could not be enumerated.

source: བསྐལ་པ་བྱེ་བ་རྣམས་ཀྱིས་ཀྱང་། །མཐའ་མ་རྟོགས་པར་སླ་བ་མིན། །
en: Even over millions of eons, The task would not easily be completed.

source: ཀུན་དགའ་བོ་དོ་མོད་ནམ་གྱི་ཐུན་ཐ་མ་ལ་སངས་རྒྱས་ང་དང་ཁྱོད་བལྟ་བའི་ཐ་མར་འགྱུར་རོ། །
en: “Ānanda, the last watch of this night will be the last time you see me, the Awakened One.

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་བྱང་ཕྱོགས་ནས་འོད་ཆེན་པོ་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་ཞིག་འོང་ཞིང་དེའི་གཟི་བརྗིད་ཀྱིས་བྱང་ཕྱོགས་ཀྱི་རྩྭ་དང་། ཤིང་གེལ་པ་དང་། ལྕུག་མ་དང་། ཚལ་དང་། ཤིང་ལྗོན་པ་དང་། སྨན་དང་།
en: “Ānanda, did you see that great shaft of golden light that came from the north?

source: ནགས་ཚལ་དང་། རི་དང་། ཐང་དང་། ཁང་བཟངས་དང་། པུ་ཤུ་དང་། གཞལ་མེད་ཁང་དང་། ཁང་པ་བརྩེགས་པ་ཐམས་ཅད་དང་། མི་དང་མི་མ་ཡིན་པ་དང་། ནམ་མཁའ་དང་། བར་སྣང་ཐམས་ཅད་འདི་ལྟ་སྟེ། གསེར་གྱི་མདོག་ལྟ་བུར་ཁ་དོག་གཅིག་ཏུ་ཀུན་ཏུ་སྣང་བར་གྱུར་པ་མཐོང་ངམ།
en: Did you see how its brilliance illuminated the entire north, all at once, with its golden color—all the grass, bushes, and shrubs, the vegetation, trees, and medicinal plants, the forests, mountains, and plains, the mansions, houses, palaces, and manors, the humans and nonhumans, the sky, and the entire space?”

source: ཀུན་དགའ་བོ་དེ་བཞིན་དུ་ཁྱོད་ཀྱིས་བྱང་ཕྱོགས་ནས་འཛམ་བུ་ཆུ་བོའི་གསེར་ལས་བྱས་པའི་ཁང་པ་བརྩེགས་པ་བདུན་འོང་ཞིང་ཁང་པ་བརྩེགས་པ་དབུས་མའི་ནང་ན་གཟི་བརྗིད་མཆོག་དང་ལྡན་ཞིང་དཔལ་གྱིས་རྣམ་པར་མཛེས་པའི་ཁྱེའུ་ཞིག་སྐྱིལ་མོ་ཀྲུང་གིས་འདུག་པ་མཐོང་ངམ།
en: “Ānanda, did you see the seven storied mansions made from Jambu River gold that arrived from the north? And did you see a beautiful, splendid, and magnificent child sitting cross-legged in the middle storied mansion?”

source: ཀུན་དགའ་བོ་ཁྱེའུ་འདི་ནི་མངོན་པར་ཤེས་པའི་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ཐོབ་པ་ཞེས་བྱ་སྟེ།
en: “Ānanda, this child is called Flower of Clairvoyance.

source: འདི་ནས་བྱང་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་འབུམ་ཕྲག་དྲུག་ཅུ་རྩ་བཞི་འདས་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱང་ཆུབ་ཡན་ལག་གནས་ཞེས་བྱ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་མེ་ཏོག་ཅན་ཞེས་བྱ་བ་ཞིག་ཡོད་པ་དེ་ནས་ཤི་འཕོས་ནས་འཇིག་རྟེན་གྱི་ཁམས་འདིར་སྐྱེས་པ་ཡིན་ནོ། །
en: Sixty-four trillion buddha fields north of here, in the buddha field of the thus-gone, worthy, perfect buddha called Resting in the Branches of Awakening, he died in Puṣpavatī and was reborn here, in this world.

source: ཀུན་དགའ་བོ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཚིག་གི་སྒྲ་འབྱུང་སྟེ། རྩྭ་དང་།
en: Ānanda, the sounds of the words of the branches of awakening come from that world.

source: ཤིང་གེལ་པ་དང་། ལྕུག་མ་དང་། ཤིང་ལྗོན་པའི་ཚོགས་དང་། སྨན་དང་། ནགས་ཚལ་ཐམས་ཅད་ལས་ཀྱང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཚིག་གི་སྒྲ་འབྱུང་ངོ་། །
en: There, the sounds of the words of the branches of awakening resound from every blade of grass, from every bush, shrub, tree, medicinal plant, and forest.

source: སྒྲ་དེས་སེམས་ཅན་དག་དགེ་བའི་ཆོས་རྣམས་ཀྱིས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །
en: Those sounds ripen the virtuous qualities of beings.

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གནས་དེ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་བསྐལ་པ་དྲུག་ཁྲི་བཞི་སྟོང་དུ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་སོ། །
en: Ānanda, the Thus-Gone One Branches of Awakening has been sustained there for sixty-four thousand eons since his attainment of perfect buddhahood in unsurpassed, completely perfect awakening.

source: དེ་བཞིན་གཤེགས་པ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་མ་གཏོགས་པར་ཉན་ཐོས་ནི་མི་མངའ་སྟེ། །
en: With that thus-gone one there are no hearers, only bodhisattvas.

source: ཀུན་དགའ་བོ་འདི་ལྟ་སྟེ་དཔེར་ན། རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་ཞིག་ལ་བུ་མང་པོ་བདོག་པར་གྱུར་ན་དེའི་བློན་པོ་རྣམས་ཀྱང་བུ་ཉིད་ཡིན་པར་འགྱུར་ལ། བློན་པོ་བཀའ་ལ་གཏོགས་པ་རྣམས་ཀྱང་བུ་ཉིད་ཡིན། མཆོག་གི་ཟུང་ཡང་བུ་ཉིད་ཡིན། རྒྱལ་ཕྲན་རྣམས་ཀྱང་བུ་ཉིད་ཡིན་པར་འགྱུར་རོ། །
en: “Ānanda, it is like this: when, to give an analogy, a crown-anointed king of a royal line has many sons, his ministers are also his sons, his ministerial advisors are also his sons, his closest attendants are also his sons, and vassal kings are also his sons.

source: དེ་བཞིན་དུ་བཅོམ་ལྡན་འདས་དེའི་སྲས་རྣམས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཡིན་ལ། བློན་པོ་རྣམས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཡིན། བློན་པོ་བཀའ་ལ་གཏོགས་པ་རྣམས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཡིན། མཆོག་གི་ཟུང་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཡིན། རིམ་གྲོ་བ་རྣམས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཡིན།
en: Likewise, the sons of that blessed one are bodhisattvas, the ministers are also bodhisattvas, the ministerial advisors are also bodhisattvas, the closest attendants are bodhisattvas, and everyone in his service is a bodhisattva.

source: དགེ་འདུན་དཀོན་མཆོག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཤ་སྟག་གོ། །ཀུན་དགའ་བོ་དེ་ལྟར་ན་འཇིག་རྟེན་གྱི་ཁམས་དེ་ནི་འབྱོར་པ་དང་། རྒྱས་པ་དང་།
en: So his Saṅgha consists of nothing but bodhisattvas.

source: བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། དགའ་བ་དང་། སྐྱེ་བོ་དང་། མི་མང་པོས་གང་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་འདུས་པ་རྣམས་ཀྱང་མངོན་པར་ཤེས་པ་མངོན་པར་འཕགས་པ།
en: So, Ānanda, that world is rich, prosperous, and happy, with good crops and full of joyous creatures and many people, and the bodhisattvas assembled there have the exalted higher perceptions.

source: ན་ཚོད་ཀྱི་ཚུལ་གྱིས་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཀུན་ཏུ་སྡུད་པ། ཤེས་རབ་བརྩེགས་པས་མངོན་པར་འཕགས་པ། ཡེ་ཤེས་ཡང་དག་པར་བསགས་པ་དང་ལྡན་པ། བྱང་ཆུབ་ཀྱི་སེམས་ལ་མངོན་པར་བརྩོན་པ། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡང་དག་པར་སྡུད་པ་ལ་བརྩོན་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཚད་མེད་པ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཤ་སྟག་གནས་ཏེ།
en: Only bodhisattvas—with the boundless qualities of bodhisattvas—live there, in accordance with their age, settling in deep absorption, ascending by stages to the summit of insight, correctly accumulating wisdom, earnestly developing the mind set on awakening, and striving to realize omniscient wisdom.

source: ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་མངོན་པར་ཤེས་པའི་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ཐོབ་པ་ཞེས་བྱ་བའི་རིགས་ཀྱི་བུ་འདི་གང་ནས་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་འཛམ་བུའི་གླིང་འདི་ཉིད་དུ་ཡངས་པ་ཅན་གྱི་གྲོང་ཁྱེར་དུ་སྐྱེས་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ནི་དེ་ལྟ་བུའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤ་སྟག་གིས་ཡོངས་སུ་གང་བ་ཡིན་ནོ། །
en: Ānanda, such is the world from which this noble son, the bodhisattva Flower of Clairvoyance, came to take birth in this world of Jambudvīpa, in Vaiśālī—from a world filled with nothing but bodhisattva great beings.

source: ཀུན་དགའ་བོ་རིགས་ཀྱི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་ངའི་ཞབས་ལ་ཕྱག་འཚལ་ཞིང་དེ་བཞིན་གཤེགས་པ་ངའི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ཆེན་པོ་འདི་ཡང་བལྟ་བའི་ཕྱིར་རྫུ་འཕྲུལ་འདི་ལྟ་བུ་དག་ཀུན་ཏུ་སྟོན་ཅིང་འོང་སྟེ། ཀུན་དགའ་བོས་སྣང་བ་ཆེན་པོ་འདི་ཡང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེའི་མཐུ་ཡིན་ནོ། །
en: “Ānanda, the miracles displayed by this noble son as he came here to bow at my, the Thus-Gone One’s, feet and to witness my, the Thus-Gone One’s, passing into great parinirvāṇa, this great apparition, Ānanda, comes from the power of that thus-gone, worthy, completely perfect buddha.

source: ཀུན་དགའ་བོ་འཛམ་བུ་ཆུ་བོའི་གསེར་ལས་བྱས་པའི་ཁང་པ་བརྩེགས་པ་བདུན་པོ་འདི་དག་ཀྱང་བཅོམ་ལྡན་འདས་དེས་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་བཤད་པ་དག་སྤྲུལ་པ་མཛད་པ་ཡིན་ནོ། །
en: Ānanda, the seven storied mansions made of Jambu River gold emanated by that blessed one illustrate the seven branches of awakening.

source: ཀུན་དགའ་བོ་འཛམ་བུའི་གླིང་འདི་ན་ཁྱེའུ་འདི་དང་ལྷན་ཅིག་ཏུ་དགེ་བའི་རྩ་བ་བསྐྱེད་པའི་སྲོག་ཆགས་བྱེ་བ་འབུམ་ཕྲག་མང་པོ་དག་ཀྱང་ཡོད་དེ།
en: “Ānanda, this child is accompanied in Jambudvīpa by many trillions of beings who have cultivated roots of virtue.

source: ཁྱེའུ་འདི་འཛམ་བུའི་གླིང་འདིར་སྐྱེས་མ་ཐག་ཏུ་ལྷ་དང་མི་རྣམས་དགའ་བ་དང་མཆོག་ཏུ་དགའ་བ་རྒྱ་ཆེན་པོ་ཐོབ་པར་གྱུར་ཏོ། །དེ་དག་ལས་ཁ་ཅིག་གིས་ནི་ཟག་པ་ཟད་པ་ཐོབ་བོ། །ཁ་ཅིག་གིས་ནི་སློབ་པའི་ས་ཐོབ་བོ། །
en: As soon as this child was born in Jambudvīpa, gods and humans were joyful, and as they experienced the greatest elation, some among them exhausted their defilements, while others were established at the level of training.

source: སྔོན་སེམས་མ་བསྐྱེད་པ་ཁ་ཅིག་གིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །ཁ་ཅིག་གིས་ནི་སེམས་བསྐྱེད་མ་ཐག་ཏུ་ཕྱིར་མི་ལྡོག་པའི་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: Some who had never before generated it generated the mind set on unsurpassed, completely perfect awakening, and some, as soon as they generated the mind set on awakening, gained acceptance of irreversibility.

source: ཀུན་དགའ་བོ་གང་ན་ཁྱེའུ་འདི་སྐྱིལ་མོ་ཀྲུང་གིས་འདུག་ཅིང་འོད་འབྱུང་བའི་ཁང་པ་བརྩེགས་པ་དབུས་མ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་དེའི་སྤྲུལ་པ་ཡིན་ནོ། །དེ་ལས་ནི་རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པ་ལྷག་མ་དྲུག་པོ་གཞན་དག་ཀྱང་འབྱུང་ངོ་། །
en: “Ānanda, the central storied mansion emitting light, in which this child was sitting cross-legged, was emanated by that thus-gone one, and the other six lavish storied mansions came from that.

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་དེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མངོན་པར་ཤེས་པའི་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ཐོབ་པས་གང་གིས་འཇིག་རྟེན་གྱི་ཁམས་འདི་འོད་ཀྱིས་ཁྱབ་པར་བྱས་ཤིང་འདི་ལྟ་སྟེ།
en: Ānanda, in this way, that thus-gone one and the bodhisattva great being Flower of Clairvoyance were able to suffuse this entire world system with light.

source: ཆོས་ཡང་དག་པར་འཛིན་པས་སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ལ་ཕན་འདོགས་པའི་མཐུ་ལ་ལྟོས།
en: By correctly upholding the Dharma, look at the power they have to benefit countless beings!”

source: དེ་ནས་ཁྱེའུ་དེ་དག་ཐམས་ཅད་ལྷན་ཅིག་ཚོགས་ཏེ་ཡང་དག་པར་དགའ་ཞིང་སྲོག་ཆགས་འབུམ་ཕྲག་མང་པོས་ཡོངས་སུ་བསྐོར་ནས་སྐད་ཅིག་གཅིག་མ་ཐལ་བར་མེ་ཏོག་སྣ་ཚོགས་ཀྱི་ཆར་དག་མངོན་པར་རབ་ཏུ་འབེབས་ཤིང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་གཏུགས་སོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མངོན་པར་ཤེས་པའི་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ཐོབ་པ་འདིས་འཛམ་བུ་ཆུ་བོའི་གསེར་ལས་བྱས་པའི་ཁང་པ་བརྩེགས་པ་དང་ལྡན་པའི་ཆོ་འཕྲུལ་གྱིས་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་ནི་དགྲ་བཅོམ་པ་ཉིད་དུ་བཏུལ་ཏོ། །སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་ནི་སློབ་པའི་སར་བཏུལ་ཏོ། །སེམས་ཅན་བྱེ་བ་ཕྲག་བརྒྱ་ནི་དཀོན་མཆོག་གསུམ་ལ་དད་པར་བྱས་ཤིང་བསླབ་པའི་གཞི་ལྔ་འཛིན་དུ་བཅུག་གོ། །
en: All the boys then gathered together and rejoiced, surrounded by many hundreds of thousands of beings as they touched the feet of the Blessed One, immediately causing a rain of many kinds of flowers to fall.

source: ལྷ་བྱེ་བ་ཕྲག་བདུན་བརྒྱ་ནི་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་དེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ཉིད་དུ་ངེས་པར་བྱས་སོ། །ལྷ་བྱེ་བ་ཕྲག་བདུན་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པ་ལ་རབ་ཏུ་བཀོད་དོ། །སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་ཚད་མེད་གྲངས་མེད་པ་དག་ནི་བྱམས་པའི་འདུས་པ་མཐོང་བ་དང་། བྱམས་པ་མཐོང་ཞིང་ཕྲད་པར་འགྱུར་བའི་ཕྱིར་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: The Blessed One then said to Venerable Ānanda, “Due to the bodhisattva great being Flower of Clairvoyance’s magical emanation of storied mansions made of Jambu River gold, millions upon billions of beings have been tamed into the state of arhatship; millions upon billions of beings have been tamed to the level of training; a billion beings have gained faith in the Three Jewels and have committed to the five basic precepts; seventy million one hundred gods have been firmly established in awakening with certainty in their irreversibility on the path to unsurpassed, completely perfect awakening; seventy million gods have been firmly established in acceptance of the unborn nature of phenomena; and countless millions upon billions of beings have seen Maitreya’s assembly and later, when fully matured, will see and meet Maitreya.

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱ་བ་གང་ཡིན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྲས་ཀྱི་ཐུ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱ་བ་གང་ཡིན་པ་དེ་དག་ནི་ང་དང་འདི་དག་གིས་ཡོངས་སུ་རྫོགས་པར་བྱས་ཟིན་ཏོ། །
en: “Ānanda, whatever a thus-gone one can do for the benefit of beings and whatever a thus-gone one’s heart sons, the bodhisattva great beings, can do for the benefit of beings has already been done by me and by these ones.

source: ངས་སེམས་ཅན་རྣམས་ཀྱི་དོན་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་གང་ཡིན་པ་དེ་ཡང་ངས་ཡོངས་སུ་རྫོགས་པར་བྱས་ཟིན་ཏོ།། །།བམ་པོ་གསུམ་པ་སྟེ་ཐ་མ།
en: Whatever I can do for the benefit of beings, I have already done.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སེམས་ཅན་རྣམས་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་བསྐལ་པའམ་བསྐལ་པ་ལས་ལྷག་པར་བཞུགས་སུ་གསོལ།
en: Venerable Ānanda then entreated the Blessed One, “Blessed One, for the love of beings, please stay for an eon, or for more than an eon!

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why?

source: ཇི་སྲིད་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཇིག་རྟེན་ན་བཞུགས་པར་འགྱུར་བ་དེ་སྲིད་དུ་སྐྱེས་བུ་དམ་པ་འདི་ལྟ་བུ་དག་མཐོང་བར་འགྱུར་བ་དང་། དེ་སྲིད་དུ་སེམས་ཅན་དགེ་བ་འདི་ལྟ་བུ་དག་འཛམ་བུའི་གླིང་འདིར་མཆི་བར་འགྱུར་བ་དང་།
en: Because if the blessed, thus-gone, worthy, perfect Buddha were to remain in this world, we would continue to see sublime beings like these.

source: དེ་སྲིད་དུ་བདག་ཅག་གིས་སྐྱེས་བུ་དམ་པ་འདི་ལྟ་བུ་དག་ལ་བལྟ་བ་དང་། བསྙེན་བཀུར་བགྱི་བ་དག་རྙེད་པར་འགྱུར་བ་དང་།
en: If virtuous beings such as these come to Jambudvīpa and we look upon such sublime beings, we will have the opportunity to serve them.

source: དེ་སྲིད་དུ་འཇིག་རྟེན་ན་མདོ་སྡེ་འདི་ལྟ་བུ་འདི་དག་རྒྱས་པར་འགྱུར་བ་དང་། དེ་སྲིད་དུ་སངས་རྒྱས་ཀྱི་ཆོས་རྒྱ་ཆེན་པོ་དང་ལྡན་པའི་མདོ་སྡེ་འདི་ལྟ་བུ་འདི་ཐོས་པར་འགྱུར་བ་དང་། དེ་སྲིད་དུ་བདག་ཅག་གིས་བཅོམ་ལྡན་འདས་དང་རིགས་ཀྱི་བུ་འདི་དག་གི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་སྣ་ཚོགས་འདི་ལྟ་བུ་འདི་དག་མཐོང་བར་འགྱུར་བ་དང་།
en: Discourses like this one will proliferate in the world, extensive discourses of the Buddha’s Dharma such as this will be heard, and we will witness various miraculous manifestations such as those displayed by these blessed ones and noble sons.

source: དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ན་བདག་ཅག་ལ་གནས་གསུམ་ཡོངས་སུ་ཉམས་པར་འགྱུར་ལགས་ཏེ།
en: If the Thus-Gone One passes into parinirvāṇa, we will surely lose three great things.

source: གསུམ་གང་ལགས་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What three?

source: སངས་རྒྱས་ལ་བལྟ་བ་དང་། དམ་པའི་ཆོས་མཉན་པ་དང་། རྒྱ་ཆེན་པོ་ལ་མོས་པའི་སྐྱེས་བུ་དམ་པ་འདི་ལྟ་བུ་དག་ལ་བལྟ་བ་དང་།
en: Looking upon the Buddha, hearing his sublime Dharma, and looking upon and serving a sublime being such as this, inclined toward the vast.

source: བསྙེན་བཀུར་བགྱི་བ་ཡོངས་སུ་ཉམས་པར་འགྱུར་བའི་སླད་དུའོ། །
en: These will be lost.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་ཚིག་དེ་དག་གསོལ་ནས་ཤིན་ཏུ་མྱུར་བར་དགེ་བའི་བཤེས་གཉེན་དང་བྲལ་བར་འགྱུར་རོ་སྙམ་ནས་ངུ་བར་བྱེད།
en: That is why!” After he had spoken these words, Venerable Ānanda thought, “I will very soon be separated from my spiritual mentor,” and he wept.

source: སྨྲེ་སྔགས་འདོན་པར་བྱེད་ཅིང་མཆི་མ་དག་ཕྱིས་ནས་ཤིང་བཅད་དེ་འགྱེལ་བ་བཞིན་དུ་ས་ལ་སྒྱེལ་ཏོ། །
en: Lamenting and sobbing, he threw himself on the ground, falling like a felled tree.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དོན་ལེགས་པར་སེམས་པས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། འདུས་བྱས་རྟག་པར་འགྱུར་བ་ཡི། །གནས་འདི་རྙེད་པར་མི་འགྱུར་ཏེ། །
en: The bodhisattva great being Sucintitārtha then spoke to Venerable Ānanda in verse: “You do not seem to have understood the point Of composite things being impermanent!

source: འདུས་བྱས་ཐམས་ཅད་མི་རྟག་པས། །མྱ་ངན་མ་བྱེད་ཀུན་དགའ་ཁྱོད། །
en: Since everything composite is impermanent, Do not grieve, Ānanda!

source: བརྟགས་པས་འདུས་བྱས་འབྱུང་འགྱུར་ཞིང་། །རྟོག་པ་དེ་ཡང་མི་རྙེད་དེ། །
en: “Examination shows that there are only composite things— You have not even understood that!

source: དེ་ལྟར་ཆོས་སྟོང་ཀུན་དགའ་ཁྱོད། །ཅི་ཡི་ཕྱིར་ན་མྱ་ངན་བྱེད། །
en: Phenomena are empty, Ānanda, So why do you grieve?

source: བརྟགས་པས་ཤེས་པ་སྟོང་པ་སྟེ། །ཤེས་པ་རྣམས་ཀྱིས་སངས་རྒྱས་སྟོང་། །
en: “Examination shows that knowledge is empty And that awakening is empty of all knowledge.

source: དེ་ལ་སངས་རྒྱས་མི་དམིགས་ན། །ཅི་ཕྱིར་ཀུན་དགའ་མྱ་ངན་བྱེད། །
en: If the buddha cannot be found, Why do you grieve, Ānanda?

source: དངོས་རྣམས་ནམ་མཁའ་འདྲ་བ་དང་། །སྨིག་རྒྱུ་ལ་ནི་ཆུ་བཞིན་པས། །བརྟག་མེད་རྣམ་པས་མི་བརྟག་ཅིང་། །མཁས་པ་རྣམ་པར་མ་རྟོག་ཤིག །
en: “Since things are like the sky, Or like reflections on water, They are unanalyzable, nonconceptual— So do not conceptualize, wise one!

source: ཇི་ལྟར་སྒྱུ་མའི་མཁན་པོ་ཡིས། །རྟ་དང་གླང་པོ་བཞོན་པ་དང་། །སྐྱེ་དགུའི་ཚོགས་དང་ལྗོན་ཤིང་ཚལ། །མེ་ཏོག་འབྲས་བུ་དགའ་སྤྲུལ་ལྟར། །དེ་བཞིན་འདུས་བྱས་ཐམས་ཅད་ཀྱང་། །སྒྱུ་མ་བཞིན་དུ་སྙིང་པོ་མེད། །
en: “Like the delightful conjurations of a skilled magician— Carriages pulled by horses and elephants, Hosts of creatures, and all manner of plants, Flowers, and fruits— “So, too, are all composite things, Like these illusions, without essence.

source: སངས་རྒྱས་རྣམས་དང་ཉན་ཐོས་ཀྱང་། །གཞན་མིན་དེ་བཞིན་ཁོ་ན་ཡིན། །
en: The Buddha and his disciples are no different; Such is the way things are.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་རིགས་ཀྱི་བུ་དོན་ལེགས་པར་སེམས་པ་ལ་ཕྱིར་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་ཏེ། །ཆོས་རྣམས་ཐམས་ཅད་མཚན་ཉིད་མེད། །
en: Venerable Ānanda then replied in verse to the noble son Sucintitārtha: “It is just as you have said: All phenomena lack characteristics.

source: དེ་འདྲའི་ཆོས་མཆོག་བདག་གིས་ནི། །མཉན་པའི་ཐ་མ་དེ་རིང་ཡིན། །
en: But today is the last time I will hear the best of teachings.

source: ཇི་ལྟར་མཉན་ཡོད་འཇུག་བྱ་ཞིང་། །
en: “How can I enter Śrāvastī?

source: ཀུན་དགའ་རྫོགས་སངས་ག་ལ་བཞུགས། །
en: What should I say when I am asked, ‘Ānanda, where will the perfect Buddha reside?

source: སྤྱན་ལྡན་གང་ནས་བྱོན་འགྱུར་ཞེས། །དྲིས་ན་ཇི་སྐད་བརྗོད་པར་བྱ། །
en: From where will the seer arrive?’

source: དྲི་གཙང་ཁང་པ་མི་མཆོག་གིས། །སྟོང་པར་བཞུགས་ནས་ཇི་ལྟར་བལྟ། །
en: “How can I look upon the perfumed chamber When the supreme one is not there?

source: ཁྲི་གདན་སྟོང་པ་མཐོང་འགྱུར་ན། །ཇི་ལྟར་གནས་འགྱུར་བརྟུལ་ཞུགས་བཟང་། །
en: How can I maintain good discipline When I look upon an empty throne?”

source: དེ་ནས་རིགས་ཀྱི་བུ་རབ་ཏུ་ཞི་བར་གནས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། ལོ་གྲངས་བྱེ་བར་དུས་ཀྱང་ནི། །དོན་འདི་རྙེད་པར་ཤིན་ཏུ་དཀའ། །
en: Then the noble son Thoroughly at Peace spoke to Venerable Ānanda in verse: “Even after ten million years, The truth will be extremely hard to find.

source: ཆོས་དབྱིངས་ཤིན་ཏུ་བལྟ་དཀའ་བ། །སོ་སོར་རྟོག་ཤིག་ཀུན་དགའ་བོ། །
en: So investigate carefully, Ānanda, Since the field of phenomena is difficult to see.

source: ཇི་ལྟར་ཆུ་ཤིང་སྡོང་པོ་ནི། །ཤུན་པ་རིམ་གྱིས་བཤུས་གྱུར་ན། །དེ་ལ་སྙིང་པོ་མེད་པ་ལྟར། །ཆོས་རྣམས་རང་བཞིན་དེ་དང་འདྲ། །
en: “Just as you can peel layers From the trunk of a plantain tree And find no core within, Such is the nature of phenomena.

source: ཇི་ལྟར་ཆར་པ་བབ་པ་ན། །མདོར་ན་ཆུ་ཡི་ཆུ་བུར་དག །སྐྱེ་ཞིང་འགག་པར་འགྱུར་བ་ལྟར། །འགྲོ་འདིའི་དངོས་པོ་དེ་དང་འདྲ། །ཇི་ལྟར་དབུ་བ་རྡོས་པ་ལ། །
en: “Just as bubbles briefly form When rain falls on water— They are born and then they cease— Such is the material reality of this life.

source: མིག་ཅན་སྙིང་པོ་རྟོག་པ་ན། དེ་ལ་སྙིང་པོ་མེད་པ་ལྟར། །འགྲོ་བ་འདི་ཀུན་དེ་དང་འདྲ། །
en: “Just as when you look for an essence Within a swelling mass of foam No essence is found, So is it with everything in this life.

source: ཇི་ལྟར་མེ་ལོང་གཟུགས་བརྙན་ནི། །རང་བཞིན་སྙིང་པོ་མེད་པ་ལྟར། །ཁམས་གསུམ་འཇིག་རྟེན་དེ་འདྲ་ཡིས། །མཁས་པ་ངུ་བར་མ་བྱེད་ཅིག །
en: “Just as an image reflected in a mirror Lacks an essential nature, So is it with the three realms, So do not cry, learned one!”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་ཞི་བར་གནས་ལ་ཕྱིར་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། མཁས་པ་ཇི་སྐད་ཟེར་བ་དེ། །ཁོ་བོས་མི་ཤེས་མ་ཡིན་ཏེ། །དྲང་སྲོང་ཆེན་པོས་མདོ་སྡེ་ལས། །འཇིག་རྟེན་གསུམ་ཀུན་དངོས་མེད་གསུངས། །
en: Venerable Ānanda then replied to the noble son Thoroughly at Peace in verse: “Learned one, it is not that I Do not understand what you say, For in the discourses, the mighty sage has taught That the entire triple world is unreal.

source: ལྷ་རྣམས་བྱེ་བ་ངུ་བཞིན་དང་། །མཆི་མས་བརྣངས་པ་འདི་དག་ནི། །བདག་གི་དྲུང་དུ་ཉེར་ལྷགས་ཤིང་། །ངུ་བས་བདག་གི་སྡུག་བསྔལ་བསྐྱེད། །
en: “But it is the weeping of ten million gods, Crying, weeping, and choked with tears, Coming before me That has caused me pain.

source: སྤྱན་དང་ལྡན་པས་བདག་བོར་ཏེ། །
en: “The seer abandons me!

source: རྫོགས་པའི་སངས་རྒྱས་འདི་བཞུད་ན། །ཁོ་བོ་གང་ཕྱོགས་འགྲོ་བྱ་ཞིང་། །
en: When the perfect Buddha leaves, Where will I go?

source: སུ་ཞིག་བདག་གི་སྐྱོབ་པར་འགྱུར། །
en: Who will protect me?

source: ཨེ་མའོ་སངས་རྒྱས་ཤིན་ཏུ་དཀོན། །
en: “Alas! The Buddha is so rare.

source: བདག་གིས་སུ་ལ་མཆོད་བྱ་ཞིང་། །
en: To whom will I make offerings?

source: ཞི་བ་ཟབ་མོ་བལྟ་དཀའ་བའི། །དམ་ཆོས་སུ་ལས་མཉན་པར་བྱ། །
en: From whom will I hear the sublime Dharma, The teachings on profound peace, so hard to find?”
